## Plan Result (dev_appgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]
  * module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw"
    }

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw"
        name                              = "aks-fe-00-dev-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (7 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "pre-portal"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/darts-portal" -> null
          - name                                = "darts-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/darts-portal" -> null
          - probe_name                          = "darts-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-casetracker" -> null
          - name                                = "dev-casetracker" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-casetracker" -> null
          - probe_name                          = "dev-casetracker" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-certificatedbailiffs" -> null
          - name                                = "dev-certificatedbailiffs" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-certificatedbailiffs" -> null
          - probe_name                          = "dev-certificatedbailiffs" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-courtfines" -> null
          - name                                = "dev-courtfines" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-courtfines" -> null
          - probe_name                          = "dev-courtfines" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-immigrationappealsonline" -> null
          - name                                = "dev-immigrationappealsonline" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-immigrationappealsonline" -> null
          - probe_name                          = "dev-immigrationappealsonline" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-admin-appeals" -> null
          - name                                = "dev-trib-admin-appeals" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-admin-appeals" -> null
          - probe_name                          = "dev-trib-admin-appeals" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-care-standards" -> null
          - name                                = "dev-trib-care-standards" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-care-standards" -> null
          - probe_name                          = "dev-trib-care-standards" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-cicap" -> null
          - name                                = "dev-trib-cicap" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-cicap" -> null
          - probe_name                          = "dev-trib-cicap" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-employment-appeals" -> null
          - name                                = "dev-trib-employment-appeals" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-employment-appeals" -> null
          - probe_name                          = "dev-trib-employment-appeals" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-finance-tax" -> null
          - name                                = "dev-trib-finance-tax" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-finance-tax" -> null
          - probe_name                          = "dev-trib-finance-tax" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-immigration-svcs" -> null
          - name                                = "dev-trib-immigration-svcs" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-immigration-svcs" -> null
          - probe_name                          = "dev-trib-immigration-svcs" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-info-rights" -> null
          - name                                = "dev-trib-info-rights" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-info-rights" -> null
          - probe_name                          = "dev-trib-info-rights" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-land-reg-division" -> null
          - name                                = "dev-trib-land-reg-division" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-land-reg-division" -> null
          - probe_name                          = "dev-trib-land-reg-division" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-lands-chamber" -> null
          - name                                = "dev-trib-lands-chamber" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-lands-chamber" -> null
          - probe_name                          = "dev-trib-lands-chamber" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/dev-trib-tansport-appeals" -> null
          - name                                = "dev-trib-tansport-appeals" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/dev-trib-tansport-appeals" -> null
          - probe_name                          = "dev-trib-tansport-appeals" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/portal-dev" -> null
          - name                                = "portal-dev" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/portal-dev" -> null
          - probe_name                          = "portal-dev" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/sds-api-mgmt" -> null
          - name                                = "sds-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/probes/sds-api-mgmt" -> null
          - probe_name                          = "sds-api-mgmt" -> null
          - protocol                

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

00-dev-agw/backendHttpSettingsCollection/dev-trib-tansport-appeals"
          + backend_http_settings_name = "dev-trib-tansport-appeals"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/dev-trib-tansport-appeals"
          + http_listener_name         = "dev-trib-tansport-appeals"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/dev-trib-tansport-appeals"
          + name                       = "dev-trib-tansport-appeals"
          + priority                   = 230
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/jd-bureau"
          + backend_address_pool_name  = "jd-bureau"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/jd-bureau"
          + backend_http_settings_name = "jd-bureau"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/jd-bureau"
          + http_listener_name         = "jd-bureau"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/jd-bureau"
          + name                       = "jd-bureau"
          + priority                   = 20
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/jd-public"
          + backend_address_pool_name  = "jd-public"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/jd-public"
          + backend_http_settings_name = "jd-public"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/jd-public"
          + http_listener_name         = "jd-public"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/jd-public"
          + name                       = "jd-public"
          + priority                   = 30
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/portal-dev"
          + backend_address_pool_name  = "portal-dev"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/portal-dev"
          + backend_http_settings_name = "portal-dev"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/portal-dev"
          + http_listener_name         = "portal-dev"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/portal-dev"
          + name                       = "portal-dev"
          + priority                   = 90
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/sds-api-mgmt"
          + backend_address_pool_name  = "sds-api-mgmt"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/sds-api-mgmt"
          + backend_http_settings_name = "sds-api-mgmt"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/sds-api-mgmt"
          + http_listener_name         = "sds-api-mgmt"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/sds-api-mgmt"
          + name                       = "sds-api-mgmt"
          + priority                   = 140
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/toffee"
          + backend_address_pool_name  = "toffee"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/toffee"
          + backend_http_settings_name = "toffee"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/toffee"
          + http_listener_name         = "toffee"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/toffee"
          + name                       = "toffee"
          + priority                   = 10
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/vh-admin-web"
          + backend_address_pool_name  = "vh-admin-web"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/vh-admin-web"
          + backend_http_settings_name = "vh-admin-web"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/vh-admin-web"
          + http_listener_name         = "vh-admin-web"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/vh-admin-web"
          + name                       = "vh-admin-web"
          + priority                   = 80
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/vh-test-web"
          + backend_address_pool_name  = "vh-test-web"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/vh-test-web"
          + backend_http_settings_name = "vh-test-web"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/vh-test-web"
          + http_listener_name         = "vh-test-web"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/vh-test-web"
          + name                       = "vh-test-web"
          + priority                   = 40
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/vh-video-web"
          + backend_address_pool_name  = "vh-video-web"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/vh-video-web"
          + backend_http_settings_name = "vh-video-web"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/vh-video-web"
          + http_listener_name         = "vh-video-web"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/vh-video-web"
          + name                       = "vh-video-web"
          + priority                   = 50
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/vh-video-web-pr-2057"
          + backend_address_pool_name  = "vh-video-web-pr-2057"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/vh-video-web-pr-2057"
          + backend_http_settings_name = "vh-video-web-pr-2057"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/vh-video-web-pr-2057"
          + http_listener_name         = "vh-video-web-pr-2057"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/vh-video-web-pr-2057"
          + name                       = "vh-video-web-pr-2057"
          + priority                   = 70
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendAddressPools/vh-video-web-reform"
          + backend_address_pool_name  = "vh-video-web-reform"
          + backend_http_settings_id   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/backendHttpSettingsCollection/vh-video-web-reform"
          + backend_http_settings_name = "vh-video-web-reform"
          + http_listener_id           = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/httpListeners/vh-video-web-reform"
          + http_listener_name         = "vh-video-web-reform"
          + id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/requestRoutingRules/vh-video-web-reform"
          + name                       = "vh-video-web-reform"
          + priority                   = 60
          + rewrite_rule_set_id        = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "darts-portal"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "darts-portal"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "darts-portal"
          + id                         = (known after apply)
          + name                       = "darts-portal"
          + priority                   = 260
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dev-trib-cicap"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dev-trib-cicap"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dev-trib-cicap"
          + id                         = (known after apply)
          + name                       = "dev-trib-cicap"
          + priority                   = 250
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pre-portal"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pre-portal"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pre-portal"
          + id                         = (known after apply)
          + name                       = "pre-portal"
          + priority                   = 240
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (33 unchanged blocks hidden)
    }

  # module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-dev-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":536,"Program":"tfcmt","SHA1":"","Target":"dev_appgateway","Vars":{}} -->